# PrevLayer

## Description
Function PrevLayer returns a handle to the layer in the document preceding the referenced layer.

```pascal
FUNCTION PrevLayer(h : HANDLE): HANDLE;
```

```python
def vs.PrevLayer(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to layer.|

## Version
Availability: from All Versions

## Category
* Document List Handling